# Бинарные операторы:
# Сложение: +
# Вычитание: -
# Умножение: *
# Деление: /(обычное), //(целочисленное), %(вычисление остатка)


# Унарные операторы: -(4), +(4)

# Тип данных фактически задаёт множество значений объектов

# Python - динамически типизированный язык

# x = 5
# y = 10
# print((y > (x * x)) or (y >= (2 * x)) and x < y)
#
# n = int(input())
# word = "программист"
#
# if (n % 2 == 0 or n % 3 == 0 or n % 4 == 0) and (n < 5 or n > 20) and n != 0:
#     if n % 10 == 1:
#         end = ""
#     else:
#         end = "а"
# elif n == 1:
#     end = ""
# else:
#     end = "ов"
#
# print(n, word + end)

n = input()
e = int(n[-1])
word = "программист"


if n == "1":
    end = ""

elif e in [0, 1, 5, 6, 7, 8, 9] or int(n[-2:]) in [12, 13] or int(n) in [12, 13]:
    end = "ов"

else:
    end = "а"

print(n, word + end)
