# Можно переписывать значение переменной, а также нельзя принтить необъявленную переменную
# a = 2
# b = 3
# print(a + b)
# a = 6
# b = b + 2
# print(a + b)
# print(c)

# увеличить значение на 3. Это работает почти со всеми операциями.
# a += 3
# a = a + 3

# в питоне динамическая типизация, из-за чего переменная может менять свой тип данных по ходу выполнения программы
# a = 1
# print(type(a))
# a = "a"
# print(type(a))

# X = int(input())
# print(X//60)
# print(X%60)

# X = int(input())
# H = int(input())
# M = int(input())
# print((480+(60*H+M))//60)
# print((480+(60*H+M))%60)